caarlos0/jvm
djui/alias-tips
caarlos0-graveyard/zsh-mkc
# it should be before zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
caarlos0/ports
ohmyzsh/ohmyzsh
# it should be after oh-my-zsh
dracorp/azure-cli-zsh-completion
# Themes
romkatv/powerlevel10k
